---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsDeletedPastedToKeep
source: html/1cc32ddf-82d8-5b8b-1eed-2abda86d7d4b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsDeletedPastedToKeep Property

Elements were deleted. Use Edit Pasted Elements to keep them.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsDeletedPastedToKeep { get; }
```